app/views/books/index.html.slim

	p Author
		= User.find_by_id(b.user_id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]