app/views/books/show.html.slim

strong Author:
= User.find_by_id(@book.user_id).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]