app/views/books/show.html.slim

		.genres
			- @book.genres.each do |g|
---
SELECT "genres".* FROM "genres" INNER JOIN "classifications" ON "genres"."id" = "classifications"."genre_id" WHERE "classifications"."book_id" = $1  [["book_id", 19]]