app/controllers/books_controller.rb

INSERT INTO "books" ("name", "argument", "isdraft", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["argument", ""], ["isdraft", "t"], ["user_id", 5], ["created_at", "2016-01-24 14:14:57.462282"], ["updated_at", "2016-01-24 14:14:57.462282"]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @book = Book.new(book_params)
    if !params[:genres].nil?
	    params[:genres].each do |g|
	    	@book.genres.push(Genre.find_by_id(g))

SELECT "genres".* FROM "genres" INNER JOIN "classifications" ON "genres"."id" = "classifications"."genre_id" WHERE "classifications"."book_id" = $1  [["book_id", 23]]
UPDATE "books" SET "isdraft" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["isdraft", "t"], ["updated_at", "2016-01-24 13:34:39.443448"], ["id", 9]]
---
  def update
  	@book.genres = Array.new
  	if !params[:genres].nil?
	  	params[:genres].each do |g|
	    	@book.genres.push(Genre.find_by_id(g))